Autodesk.Revit.DB.Analysis.SystemsAnalysisOptions.OutputFolder
The path of the output folder for systems analysis.
Remarks:
When requesting a new system analysis, it is okay to have an empty output folder in the SystemsAnalysisOption. In that case,
the ViewSystemsAnalysisReport would supply the output folder, typically at the system TEMP folder.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The analysis requires a valid output folder path or empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2020.1

Autodesk.Revit.DB.Analysis.SystemsAnalysisOptions.WorkflowFile
The file name of the EnergyPlus workflow script.
Remarks:
When requesting a new system analysis, it is okay to have an empty workflowFile in the SystemsAnalysisOption. In that case,
the ViewSystemsAnalysisReport would supply the weather file with the default value "HVAC Systems Loads and Sizing.osw".
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The analysis requires a valid workflow file path or the empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2020.1

Autodesk.Revit.DB.Analysis.SystemsAnalysisOptions.ForceGbXMLExport
Force export regardless of how debug modes are set.
Since:
2020.1